{
    "titlerulesofpurchase": "Rules of purchase",
    "titlerulesofattendance": "Rules of attendance",
    "rulesofpurchase": "No refunds or exchanges. Unused tickets may be converted to a tax - deductible donation. All photography, video and audio recording is prohibited. Cameras and tape or video recorders are not allowed in the theater due to copyright law.",
    "rulesofattendance": [
        "1. Do not stand up in front of people who are sitting down",
        "2. Do not take up too much space in a pit/GA section",
        "3. DO NOT force your way to the front of the stage",
        "4. Let people pass through if they are trying to exit",
        "5. Make friends with those around you",
        "6. Let shorter people stand in front of you",
        "7. Sharing is caring!",
        "8. Do not interrupt those sitting near you with a drink run every other song",
        "9. Do not talk loudly during the concert",
        "10. Rock out and have fun!"
    ],

    "titlebandslist": "Program/Bands List/Event Description",
    "bandslist": "A City literally built on Rock n' Roll in Cadott WI, Rock Fest is the true Rock experience you can't miss. In its 26th year, it is THE top venue for people of all ages to come together for one common purpose: to congregate with other rock fans from across the world, in a place where rock music still matters. Featuring the very best of active and classic rock and legendary names in Rock Music, entertainment and experience are the first priority. Aerosmith, Iron Maiden, Avenged Sevenfold, Kiss, Motley Crue, Fleetwood Mac, Tom Petty, Kid Rock, Shinedown, Five Finger Death Punch, Rob Zombie, Korn & many more rock legends have graced this permanent Main Stage over the course of the last two and a half decades.",

    "titlehowtofind": "How to find us",
    "howtofind": "Concert Hall is located three blocks west of the park and three blocks north the library. Free parking is available nearby, which fills up close to showtime, and on the streets around. Bike racks are located outside the main entrance to the Hall.",

    "titlelearn": "Learn more at",
    "facebook": "Facebook /ConcertHall",
    "twitter": "Twitter @ConcertHall",
    "instagram": "Instagram @ConcertHall",
    "counterfoil": "This is your ticket. Print this Entire page, fold it and bring it with you to the event. Please make sure the QR code is visible."
}
